<?php

$sity = [
    "Московская область" => ["Москва", "Зеленоград", "Клин"],
    "Санкт-Петербург" => ["Всеволожск","Павловск", "Кронштадт"]
    ];

foreach ($sity as $key => $value) {

        for ($i = 0; $i < count($value); $i++) {
            if (preg_match('/К/', $value[$i])) {
                echo "$key : $value[$i]<br>";}



}};

$sity = [
    "Московская область" => ["Москва", "Зеленоград", "Клин"],
    "Санкт-Петербург" => ["Всеволожск","Павловск", "Кронштадт"]
];

echo "<hr>";

foreach ($sity as $key => $value) {
if ($key == "Московская область") {
    for ($i = 0; $i < count($value); $i++) {

        $c .= " $value[$i],";
    }

    echo "$key: <br> $c <br>";
}
if ($key == "Санкт-Петербург")
{
    for ($i = 0; $i < count($value); $i++) {

        $d .= " $value[$i],";
    }

    echo "<br> $key: <br> $d <br>";
}

};

echo "<hr>";

$msk = ["Москва", "Зеленоград", "Клин"];
$spb = ["Всеволожск","Павловск", "Кронштадт"];

for ($i = 0; $i < count($msk); $i++) {

    $a .= " $msk[$i],";}

for ($i = 0; $i < count($spb); $i++) {

    $b .= " $spb[$i],";}

echo "Московская область: <br> $a <br> Ленинградская область: <br>$b";
