<?php

function translit($s) {
    $s = (string) $s; // преобразуем в строковое значение
    $s = mb_strtolower($s); // преобразуем в нижний регистр
    $s = strtr($s, array('а'=>'a','б'=>'b','в'=>'v','г'=>'g','д'=>'d','е'=>'e','ё'=>'e','ж'=>'j','з'=>'z','и'=>'i','й'=>'y','к'=>'k','л'=>'l','м'=>'m','н'=>'n','о'=>'o','п'=>'p','р'=>'r','с'=>'s','т'=>'t','у'=>'u','ф'=>'f','х'=>'h','ц'=>'c','ч'=>'ch','ш'=>'sh','щ'=>'shch','ы'=>'y','э'=>'e','ю'=>'yu','я'=>'ya','ъ'=>'','ь'=>''));
    $s = str_replace(" ", "_", $s); // заменяем пробелы знаком нижнее подчеркивание
    return $s; // возвращаем результат
}

$s = "Проверка задания 4 и 5";
echo translit($s).'<br>';



for ($i = 0; $i <= 10; print $i, $i++);